SoapMessage.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Body xmlns:s0="urn:AiraTech:eTimeWS" xmlns:s1="http://www.w3.org/2001/XMLSchema"><s0:apSrvShiftSave><dsContext><ttContext><contextGroup>PARAM</contextGroup><contextName>pcAction</contextName><contextValue>ADD_UPDATE</contextValue><contextOperator/><contextType/></ttContext><ttContext><contextGroup>PARAM</contextGroup><contextName>pcSessionID</contextName><contextValue>wsdl.d3cd3c59-cb20-36b0-4914-915be09c6cf4.bqQlclbbMCleRdca</contextValue><contextOperator/><contextType/></ttContext><ttContext><contextGroup>PARAM</contextGroup><contextName>pcUserID</contextName><contextValue>wsdl</contextValue><contextOperator/><contextType/></ttContext><ttContext><contextGroup>PARAM</contextGroup><contextName>piBranchID</contextName><contextValue>2</contextValue><contextOperator/><contextType/></ttContext><ttContext><contextGroup>PARAM</contextGroup><contextName>piCompanyID</contextName><contextValue>2</contextValue><contextOperator/><contextType/></ttContext></dsContext><dsShifts><ttShifts><shiftid>0</shiftid><cid>2</cid><bid>2</bid><uid>1</uid><sid>1</sid><eid>0</eid><shdate>2018-12-12</shdate><tmstart>1800</tmstart><tmend>1900</tmend><breaks>0</breaks><emsrtycd>4</emsrtycd><chkin>false</chkin><chkout>false</chkout><actmstrt>0</actmstrt><actmend>0</actmend><actbreak>0</actbreak><safetime/><bilno>0</bilno><shotexmp>false</shotexmp><chotemdt xmlns:nil="true"/><billot>false</billot><shtent>false</shtent><snote/><recalcon>true</recalcon><unsched>false</unsched><pylck>false</pylck><payldate xmlns:nil="true"/><spaid>false</spaid><spaidate xmlns:nil="true"/><pclosed>false</pclosed><pclodate xmlns:nil="true"/><billck>false</billck><bilodate xmlns:nil="true"/><sbilled>false</sbilled><sbildate xmlns:nil="true"/><bclosed>false</bclosed><bclodate xmlns:nil="true"/><shtype/><safetyno>0</safetyno><crbytmen>false</crbytmen><grpshid>0</grpshid><autofill>false</autofill><cruser/><crdate>2018-12-12</crdate><crtime>0</crtime><shstatcd/><workdesc/><shtagsetcd/><ChangeGroupCode/><ChangeGroupType>0</ChangeGroupType><schStartTime>2018-12-12T00:00:00.000</schStartTime><schEndTime>2018-12-12T00:00:00.000</schEndTime><wrkStartTime>2018-12-12T00:00:00.000</wrkStartTime><wrkEndTime>2018-12-12T00:00:00.000</wrkEndTime><SelfSchStart xmlns:nil="true"/><SelfSchEnd xmlns:nil="true"/><LocationObj>0</LocationObj><SelfSchAssignTime xmlns:nil="true"/><PublishType>0</PublishType><ref1/><ref2/><ref3/><ref4/><ref5/><disp_crtime/><DbRow>0x000000</DbRow><iImport>0</iImport><cObjectName/><cValmess/><cChkNew>A</cChkNew><MidDiffScheduled>0</MidDiffScheduled><MidDiffOverlap1>0</MidDiffOverlap1><MidDiffOverlap2>0</MidDiffOverlap2><MidDiffWorked>0</MidDiffWorked><MidDiffWorkedOverlap1>0</MidDiffWorkedOverlap1><MidDiffWorkedOverlap2>0</MidDiffWorkedOverlap2><CustomerName/><CusShortName/><SiteName/><StShortName/><EmpFirstName/><EmpLastName/><EmpShortName/><LocationCode/><LocationDscr/><ServiceDescr/><ShiftTotal>0.0</ShiftTotal><Acttotal>0.0</Acttotal><chcrtime/></ttShifts></dsShifts></s0:apSrvShiftSave></SOAP-ENV:Body></SOAP-ENV:Envelope>